In [1]:
# Versão da Linguagem Python
from platform import python_version
print('Versão de Python Neste Jupyter Notebook:', python_version())

Versão de Python Neste Jupyter Notebook: 3.10.5

### Preparando os dados

A segunda etapa da análise de dados é a limpeza dos dados. Preparar dados para ferramentas analíticas pode ser uma tarefa difícil. O Python e suas bibliotecas tentam torná-lo o mais fácil possível.

Com apenas algumas linhas de código, você poderá preparar seus dados para análise. Você poderá:

- Limpar os dados.
- Criar novas variáveis.
- Organizar os dados.

#### Limpeza de dados

Para serem úteis para a maioria das tarefas analíticas, os dados devem estar limpos. Isso significa que deve ser consistente, relevante e padronizado.

- remover valores discrepantes;
- remover valores inadequados;
- remover duplicatas;
- remover pontuação;
- remover espaços em branco;
- padronizar datas;
- padronizar o texto.

#### Calculando e removendo outliers

Suponha que você esteja coletando dados sobre as pessoas com quem você estudou no ensino médio. E se você foi para a escola com Bill Gates. Agora, mesmo que a pessoa com o segundo maior patrimônio líquido tenha apenas $ 1,5 milhão, a média de toda a sua classe é aumentada pelo bilionário no topo. Encontrar os outliers permite remover os valores que são tão altos ou tão baixos que distorcem a visão geral dos dados.

Cobrimos duas maneiras principais de detectar outliers:

- 1. Desvios Padrão: Se os dados forem normalmente distribuído, então 95 por cento dos dados estão dentro de 1,96 desvios padrão da média. Portanto, podemos descartar os valores acima ou abaixo desse intervalo.

- 2. Intervalo Interquartílico (IQR): O IQR é o diferença entre o quantil de 25 por cento e o quantil de 75 por cento. Quaisquer valores inferiores a Q1 - 1,5 x IQR ou superiores a Q3 + 1,5 x IQR são tratados como outliers e removidos.

Vamos ver como eles se parecem

In [2]:
# Método 1: Desvio Padrão
import pandas as pd

caminho = "datasets/gradedata.csv" 
df = pd.read_csv(caminho) 

media_notas = df['grade'].mean()
desvio_notas = df['grade'].std() 

valores_altos = media_notas + desvio_notas * 1.96 
valores_baixos = media_notas - desvio_notas * 1.96 

copia_df = df 

copia_df = copia_df.drop(copia_df[copia_df['grade'] > valores_altos].index)
copia_df = copia_df.drop(copia_df[copia_df['grade'] < valores_baixos].index)

copia_df

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"
...,...,...,...,...,...,...,...,...
1995,Cody,Shepherd,male,19,1,8,80.1,"982 West Street, Alexandria, VA 22304"
1996,Geraldine,Peterson,female,16,4,18,100.0,"78 Morris Street, East Northport, NY 11731"
1997,Mercedes,Leon,female,18,3,14,84.9,"30 Glenridge Rd., Bountiful, UT 84010"
1998,Lucius,Rowland,male,16,1,7,69.1,"342 West Meadowbrook Lane, Helena, MT 59601"
1999,Linus,Morris,male,19,4,10,79.6,"81 Homestead Drive, Voorhees, NJ 08043"

- Linha 10: Aqui calculamos o intervalo superior igual a 1,96 vezes o desvio padrão mais a média.
- Linha 11: Aqui calculamos o intervalo inferior igual a 1,96 vezes o desvio padrão subtraído do desvio.
- Linha 15: Aqui descartamos as linhas onde a nota é maior do que o toprange.
- Linha 16: Aqui descartamos as linhas onde está a nota inferior ao botrange.

In [3]:
# Método 2: Intervalo Interquartílico
caminho = "datasets/gradedata.csv" 

df = pd.read_csv(caminho) 

q1 = df['grade'].quantile(.25) 
q3 = df['grade'].quantile(.75) 

iqr = q3-q1
valores_altos = q3 + iqr * 1.5
valores_baixos = q1 - iqr * 1.5

copia_df = df

copia_df = copia_df.drop(copia_df[copia_df['grade'] > valores_altos].index)
copia_df = copia_df.drop(copia_df[copia_df['grade'] < valores_baixos].index)

copia_df

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"
...,...,...,...,...,...,...,...,...
1995,Cody,Shepherd,male,19,1,8,80.1,"982 West Street, Alexandria, VA 22304"
1996,Geraldine,Peterson,female,16,4,18,100.0,"78 Morris Street, East Northport, NY 11731"
1997,Mercedes,Leon,female,18,3,14,84.9,"30 Glenridge Rd., Bountiful, UT 84010"
1998,Lucius,Rowland,male,16,1,7,69.1,"342 West Meadowbrook Lane, Helena, MT 59601"
1999,Linus,Morris,male,19,4,10,79.6,"81 Homestead Drive, Voorhees, NJ 08043"

- Linha 10: Aqui calculamos o `limite superior = o terceiro quartil + 1,5 * o IQR.`
- Linha 11: Aqui calculamos o `limite inferior = o primeiro quartil - 1,5 *
o IQR.`
- Linha 15: Aqui descartamos as linhas onde estão as notas
mais altas que o `valores_altos`.
- Linha 14: Aqui descartamos as linhas onde está a nota é inferior aos `valores_baixos`.

Carregue o conjunto de dados datasets/outlierdata.csv. Experimente com ambos os métodos.

In [6]:
# Método 1: Desvio Padrão
caminho = "datasets/outlierdata.csv" 

df = pd.read_csv(caminho) 

media_notas = df['Net Worth'].mean()
desvio_notas = df['Net Worth'].std() 

valores_altos = media_notas + desvio_notas * 1.96 
valores_baixos = media_notas - desvio_notas * 1.96 

copia_df = df 

copia_df = copia_df.drop(copia_df[copia_df['Net Worth'] > valores_altos].index)
copia_df = copia_df.drop(copia_df[copia_df['Net Worth'] < valores_baixos].index)

copia_df

                  Name  Net Worth
0     Stella B. Battle      13853
1    Virginia Q. Salas      18065
2       Keiko S. Berry       6169
3    Dustin U. Hopkins       4857
4     Sloane O. Atkins      14022
..                 ...        ...
95   Barbara Z. Rivera      17272
96     Lilah Q. Porter      -9786
97    Angelica Z. King          3
98    Delilah N. Sweet        350
99  Valentine X. Henry       3099

[98 rows x 2 columns]

In [7]:
# Método 2: Intervalo Interquartílico
caminho = "datasets/outlierdata.csv" 

df = pd.read_csv(caminho) 

q1 = df['Net Worth'].quantile(.25) 
q3 = df['Net Worth'].quantile(.75) 

iqr = q3-q1
valores_altos = q3 + iqr * 1.5
valores_baixos = q1 - iqr * 1.5

copia_df = df

copia_df = copia_df.drop(copia_df[copia_df['Net Worth'] > valores_altos].index)
copia_df = copia_df.drop(copia_df[copia_df['Net Worth'] < valores_baixos].index)

copia_df

                  Name  Net Worth
0     Stella B. Battle      13853
1    Virginia Q. Salas      18065
2       Keiko S. Berry       6169
3    Dustin U. Hopkins       4857
4     Sloane O. Atkins      14022
..                 ...        ...
95   Barbara Z. Rivera      17272
96     Lilah Q. Porter      -9786
97    Angelica Z. King          3
98    Delilah N. Sweet        350
99  Valentine X. Henry       3099

[97 rows x 2 columns]

#### Dados ausentes no Dataframe do pandas

Uma das coisas mais irritantes ao trabalhar com grandes conjuntos de dados é encontrar os dados que faltam. Pode tornar impossível ou imprevisível computar a maioria das estatísticas agregadas ou gerar tabelas dinâmicas. Se você procurar pontos de dados ausentes em um conjunto de dados de 50 linhas, será bastante fácil. No entanto, se você tentar encontrar um ponto de dados ausente em um conjunto de dados de 500.000 linhas, pode ser muito mais difícil.

A biblioteca `pandas` do Python tem funções para ajudá-lo a encontrar, excluir ou altere os dados ausentes.

In [8]:
# Criando Dataframe com dados ausentes

import pandas as pd 
df = pd.read_csv("datasets/gradedatamissing.csv") 

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

O código anterior carrega um conjunto de dados legítimo que inclui linhas com dados
ausentes. Podemos usar o dataframe resultante para praticar como lidar com dados ausentes.

Para descartar todas as linhas com dados ausentes (NaN), use o código mostrado em

In [9]:
# Eliminar linhas com dados ausentes

df_no_missing = df.dropna() 
df_no_missing

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035"
...,...,...,...,...,...,...,...,...
1997,Cody,Shepherd,male,19.0,1.0,8.0,80.1,"982 West Street, Alexandria, VA 22304"
1998,Geraldine,Peterson,female,16.0,4.0,18.0,100.0,"78 Morris Street, East Northport, NY 11731"
1999,Mercedes,Leon,female,18.0,3.0,14.0,84.9,"30 Glenridge Rd., Bountiful, UT 84010"
2000,Lucius,Rowland,male,16.0,1.0,7.0,69.1,"342 West Meadowbrook Lane, Helena, MT 59601"
2001,Linus,Morris,male,19.0,4.0,10.0,79.6,"81 Homestead Drive, Voorhees, NJ 08043"

Para adicionar uma coluna preenchida com valores vazios, use o código da Listagem

In [10]:
# Adicionar uma coluna com valores vazios
import numpy as np

df['newcol'] = np.nan 
df.head()

,fname,lname,gender,age,exercise,hours,grade,address,newcol
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747",NaN
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780",NaN
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060",NaN
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125",NaN
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035",NaN

Para descartar quaisquer colunas que contenham apenas valores vazios
consulte a Listagem

In [11]:
# Eliminar colunas completamente vazias

df.dropna(axis = 1, 
          how = 'all')

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035"
...,...,...,...,...,...,...,...,...
1997,Cody,Shepherd,male,19.0,1.0,8.0,80.1,"982 West Street, Alexandria, VA 22304"
1998,Geraldine,Peterson,female,16.0,4.0,18.0,100.0,"78 Morris Street, East Northport, NY 11731"
1999,Mercedes,Leon,female,18.0,3.0,14.0,84.9,"30 Glenridge Rd., Bountiful, UT 84010"
2000,Lucius,Rowland,male,16.0,1.0,7.0,69.1,"342 West Meadowbrook Lane, Helena, MT 59601"
2001,Linus,Morris,male,19.0,4.0,10.0,79.6,"81 Homestead Drive, Voorhees, NJ 08043"

Para substituir todos os valores vazios por zero, consulte a Listagem 3-7.

In [12]:
# Substituir células vazias por 0

df.fillna(0)

,fname,lname,gender,age,exercise,hours,grade,address,newcol
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747",0.0
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780",0.0
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060",0.0
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125",0.0
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035",0.0
...,...,...,...,...,...,...,...,...,...
1997,Cody,Shepherd,male,19.0,1.0,8.0,80.1,"982 West Street, Alexandria, VA 22304",0.0
1998,Geraldine,Peterson,female,16.0,4.0,18.0,100.0,"78 Morris Street, East Northport, NY 11731",0.0
1999,Mercedes,Leon,female,18.0,3.0,14.0,84.9,"30 Glenridge Rd., Bountiful, UT 84010",0.0
2000,Lucius,Rowland,male,16.0,1.0,7.0,69.1,"342 West Meadowbrook Lane, Helena, MT 59601",0.0
2001,Linus,Morris,male,19.0,4.0,10.0,79.6,"81 Homestead Drive, Voorhees, NJ 08043",0.0

Para preencher as notas que faltam com o valor médio da nota, consulte a Listagem 3-8.

In [13]:
# Substitua as células vazias pela média da coluna

df["grade"].fillna(df["grade"].mean(), 
                   inplace = True)

Observe que inplace=True significa que as alterações são salvas no dataframe
imediatamente.

Para preencher as notas que faltam com o valor médio da nota de cada gênero, consulte
Listagem 3-9.

In [14]:
# É complicado

df["grade"].fillna(df.groupby("gender")
                   ["grade"].transform("mean"), inplace=True)

Também podemos selecionar algumas linhas, mas ignorar aquelas com pontos de
dados ausentes. Para selecionar as linhas de df em que idade não é NaN e sexo não é
NaN, consulte a Listagem 3-10.

In [16]:
# Selecionando linhas sem idade ou sexo ausente

df[df['age'].notnull() & df['gender'].notnull()]

,fname,lname,gender,age,exercise,hours,grade,address,newcol
0,Marcia,Pugh,female,17.0,3.0,10.0,82.4,"9253 Richardson Road, Matawan, NJ 07747",NaN
1,Kadeem,Morrison,male,18.0,4.0,4.0,78.2,"33 Spring Dr., Taunton, MA 02780",NaN
2,Nash,Powell,male,18.0,5.0,9.0,79.3,"41 Hill Avenue, Mentor, OH 44060",NaN
3,Noelani,Wagner,female,14.0,2.0,7.0,83.2,"8839 Marshall St., Miami, FL 33125",NaN
4,Noelani,Cherry,female,18.0,4.0,15.0,87.4,"8304 Charles Rd., Lewis Center, OH 43035",NaN
...,...,...,...,...,...,...,...,...,...
1997,Cody,Shepherd,male,19.0,1.0,8.0,80.1,"982 West Street, Alexandria, VA 22304",NaN
1998,Geraldine,Peterson,female,16.0,4.0,18.0,100.0,"78 Morris Street, East Northport, NY 11731",NaN
1999,Mercedes,Leon,female,18.0,3.0,14.0,84.9,"30 Glenridge Rd., Bountiful, UT 84010",NaN
2000,Lucius,Rowland,male,16.0,1.0,7.0,69.1,"342 West Meadowbrook Lane, Helena, MT 59601",NaN
2001,Linus,Morris,male,19.0,4.0,10.0,79.6,"81 Homestead Drive, Voorhees, NJ 08043",NaN

Carregue o conjunto de dados `datasets/missinggrade.csv`. A sua missão, caso aceite, é deletar linhas com notas faltantes e substituir os valores faltantes em horas de exercício pelo valor médio daquele gênero.

#### Filtrando Valores Inadequados

Às vezes, se você estiver trabalhando com dados que não coletou, precisará se preocupar se os dados são precisos. Caramba, às vezes você precisa se preocupar com isso, mesmo que tenha coletado você mesmo! Pode ser difícil verificar a veracidade de cada ponto de dados, mas é bastante fácil verificar se os dados são apropriados.

A biblioteca pandas do Python tem a capacidade de filtrar os valores incorretos

In [ ]:
# 11. Criando conjunto de dados

nomes = ['Bob','Jéssica','Maria','João','Mel'] 
notas = [76,-2,77,78,101]
GradeList = zip(nomes,notas) 
df = pd.DataFrame(data = GradeList, columns = ['Nomes', 'Notas'])
df

Para eliminar todas as linhas em que as notas são muito altas, consulte a Listagem

In [ ]:
# Filtrando Notas Impossíveis

df.loc[df['Notas'] <= 100]

Para alterar os valores fora do limite para o máximo ou mínimo valor permitido, podemos usar o código visto na Listagem 3

In [ ]:
# Mudando Notas Impossíveis

df.loc[(df['Notas'] >= 100,'Notas')] = 100

Usando o conjunto de dados desta seção, você pode substituir todas as notas abaixo de zero por uma nota de zero?

#### Encontrando Linhas Duplicadas

Outra coisa com a qual você precisa se preocupar se estiver usando os dados de outra pessoa é se algum dado está duplicado. (Os mesmos dados foram relatados duas vezes, ou gravados duas vezes, ou apenas copiados e colados?) Caramba, às vezes você precisa se preocupar com isso, mesmo que você mesmo os tenha coletado! Pode ser difícil verificar a veracidade de cada ponto de dados, mas é muito fácil verificar se os dados estão duplicados.

biblioteca pandas do Python tem uma função para encontrar não apenas linhas duplicadas, mas também linhas únicas (Listagem 3-14).

In [ ]:
# Criando conjunto de dados com duplicatas

names = ['Jan', 'John', 'Bob', 'Jan', 
         'Mary', 'Jon', 'Mel', 'Mel'] 

notas = [95, 78, 76, 95, 77, 78, 99, 100]
GradeList = zip(nomes,notas) 
df =pd.DataFrame(data = GradeList, columns=['Nomes', 'Notas'])

df

Para indicar as linhas duplicadas, podemos simplesmente executar o código visto na Listagem 3-1

In [ ]:
# Exibindo apenas duplicatas no dataframe
 
df.duplicated()

Para mostrar o conjunto de dados sem duplicatas, podemos executar o código visto na Listagem

In [ ]:
# Exibindo conjunto de dados sem duplicatas

df.drop_duplicates()

Você pode estar se perguntando: "E se a linha inteira não estiver duplicada, mas eu ainda souber que é uma duplicata?" Isso pode acontecer se alguém fizer sua pesquisa ou refazer um exame novamente, então o nome é o mesmo, mas a observação é Nesse caso, onde sabemos que um nome duplicado significa uma entrada duplicada, podemos usar o código visto na Listagem 3-17.

In [ ]:
# Eliminar linhas com nomes duplicados, mantendo a última observação

df.drop_duplicates(['Nomes'], mantenha='último')

Carregue o conjunto de dados datasets/dupedata.csv. Achamos que pessoas com o mesmo endereço são duplicatas. Você pode descartar as linhas duplicadas enquanto mantém a primeira?

#### Removendo a pontuação do conteúdo da coluna

Seja em um número de telefone ou em um endereço, muitas vezes você encontrará pontuação indesejada em seus dados. Vamos carregar alguns dados para ver como lidar com isso (Listagem 3-18).

In [ ]:
# Carregando Dataframe com dados do arquivo CSV

caminho = "datasets/gradedata.csv"
## Para adicionar cabeçalhos enquanto carregamos os dados...
df = pd.read_csv(caminho) 
df.head()

Para remover a pontuação indesejada, criamos uma função que retorna todos os caracteres que não são pontuação e a eles aplicamos essa função em nosso dataframe (Listagem 3-19).

In [ ]:
# Removendo a pontuação da coluna de endereço

import string
exclude = set(string.punctuation) 
def remove_punctuation(x): 
    try: 
        x =''.join(ch for ch in x if ch not in exclude) 
    
    except:
        pass
    
    return x

df.address = df.address.apply(remove_punctuation) df

#### Removendo espaços em branco do conteúdo da coluna

In [ ]:
# Carregando Dataframe com dados do arquivo CSV

caminho = "datasets/gradedata.csv"
## Para adicionar cabeçalhos enquanto carregamos os dados...
df = pd.read_csv(caminho)
df.head()

Para remover o espaço em branco, criamos uma função que retorna todos os caracteres que não são de pontuação e aplicamos essa função ao nosso dataframe (Listagem 3-21).

In [ ]:
# Removendo espaços em branco da coluna de endereço
def remove_whitespace(x):
    try: 
        x = ''.join(x.split()) 
    
    except:
        pass
    
    return x

df.address = df.address.apply(remove_whitespace) 
df

#### Datas padronizadas

Um dos problemas com a consolidação de dados de diferentes fontes é que diferentes pessoas e diferentes sistemas podem registrar datas de forma diferente. Talvez eles usem 01/03/1980 ou 01/03/80 ou até mesmo 1980/01/03.

Mesmo que todas se refiram a 3 de janeiro de 1980, as ferramentas de análise podem não reconhecê-las todas como datas se você estiver alternando entre os diferentes formatos na mesma coluna.

In [2]:
# Criando Dataframe com Diferentes Formatos de Data

nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
grades = [76, 95, 77, 78, 99] 
bsdegrees = [1, 1, 0, 0, 1]
msdegrees = [2, 1, 0, 0, 0] 
phddegrees = [0, 1, 0, 0, 0]
bdates = ['1/1/1945', '21/10/76', '03/03/90', 
          '30/04/1901', '1963-09-01']

GradeList = zip(nomes, grades, bsdegrees, msdegrees, phddegrees, bdates)

colunas = ['Names', 'Grades', 'BS', 'MS', 'PhD', "bdates"]
df = pd.DataFrame(data = GradeList, columns = colunas) 
df

NameError: name 'pd' is not defined

mostra uma função que padroniza as datas para um único formato.

In [ ]:
# Função para Padronizar Datas

from time import strftime 
from datetime import datetime 

def standardize_date(thedate):
    formatted_date = thedate = str(thedate) 
    if not thedate or thedate.lower() == "missing" or data == "nan":
        formatted_date = "FALTA" 
    if the_date.lower().find('x') != -1: 
        formatted_date = "Incompleto" if the_date[0:2] == "00": 
            formatted_date = thedate.replace("00" , "19") 
            try: 
                formatted_date = str(datetime.strptime( thedate,'%m/%d/%y').strftime('%m/%d/%y')) 
            except:
                pass
            
        try: 
            formatted_date = str(datetime.strptime(adata, '%m/%d/%Y') .strftime('%m/%d/%y')) 
        
        except:
            pass
    try:
        if int(the_date[0:4]) < 1900:ou a data == "nan": data_formatada = "Incompleto"
    
        else:
            formatted_date = str(datetime.strptime( thedate,'%Y-%m-%d').strftime('%m/%d/%y')) 
    
    except:
        pass
     
    return formatted_date

Agora que temos essa função, podemos aplicá-la à coluna de datas de nascimento em nosso dataframe

In [ ]:
# Aplicando padronização de data à coluna de data de nascimento

df.bdates = df.bdates.apply(standardize_date) 
df

#### Padronização de texto

Um dos problemas com a consolidação de dados de fontes diferentes é que pessoas diferentes e sistemas diferentes podem registrar determinados dados, como números de CPF, números de telefone e códigos postais de maneira diferente. Talvez eles usem hifens nesses números, ou talvez não. Esta seção aborda rapidamente como padronizar como esses tipos de dados são armazenados.

In [ ]:
# Criando Dataframe com SSNs

nomes = ['Bob','Jessica','Mary','John','Mel'] 
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0 ,1] 
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0] 
ssns = ['867-53-0909', '333-22-4444', 
        '123 -12-1234', '777-93-9311',
        '123-12-1423']

GradeList = zip(nomes, notas, bsdegrees, msdegrees, phddegrees,ssns)
column = ['Names','Grades','BS','MS','PhD',"ssn"] 
df = pd.DataFrame(data = GradeList, columns = colunas) 
df

O código na Listagem 3-26 cria uma função que padroniza os SSNs e o aplica à nossa coluna ssn.

In [ ]:
# Remova hífens de SSNs e adicione zeros à esquerda, se necessário
def direita(s, quantidade):
    return s[-quantidade]

def padronizar_ssn(ssn): 
    try:
        ssn = ssn.replace("-","") 
        ssn = "".join(ssn.split()) 
        if len (ssn)< 9 and ssn != 'Faltando': 
            ssn="000000000" + ssn 
            ssn = direita(ssn,9)
    except:
        pass
    
    return ssn

df.ssn = df.ssn.apply(padronizar_ssn) 
df

#### Criando Novas Variáveis

Assim que os dados estiverem livres de erros, você precisará configurar as variáveis que responderão diretamente às suas perguntas. É um conjunto de dados raro em que cada pergunta que você precisa responder é respondida diretamente por uma variável. Portanto, pode ser necessário fazer muita recodificação e cálculo de variáveis para obter exatamente o conjunto de dados
isto que você precisa.

Os exemplos incluem o seguinte:

• Criação de compartimentos (como conversão de notas numéricas em letras
notas ou intervalos de datas em Q1, Q2, etc.)
• Criar uma coluna que classifique os valores em outra
coluna
• Criação de uma coluna para indicar que outro valor foi
atingiu um limite (aprovação ou reprovação, lista do reitor, etc.)
• Convertendo categorias de strings em números (para regressão
ou correlação)

#### Dados de categorização

Às vezes, você terá dados discretos que precisa agrupar em caixas.
(Pense: convertendo notas numéricas em notas alfabéticas.) Nesta lição,
aprenda sobre binning (Listagem 3-27).

In [ ]:
# Listing 3-27. Loading the Dataset from CSV

import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Agora que os dados foram carregados, precisamos definir os compartimentos e os nomes dos grupos (Listagem 3-28).

In [ ]:
# Listing 3-28. Define Bins as 0 to 60, 60 to 70, 70 to 80, 80 to 90, 90 to 100
# Create the bin dividers
bins = [0, 60, 70, 80, 90, 100]
# Create names for the four groups
group_names = ['F', 'D', 'C', 'B', 'A']

Observe que há mais um valor bin do que group_names.
Isso ocorre porque é necessário haver um limite superior e inferior para cada compartimento.

In [ ]:
# Listing 3-29. Cut Grades
df['lettergrade'] = pd.cut(df['grade'], bins,
labels=group_names)
df

A Listagem 3-29 categoriza a nota da coluna com base na lista de compartimentos e rotula os valores usando a lista group_names. E se quisermos contar o número de observações para cada categoria, podemos fazer isso também (Listagem 3-30).

In [ ]:
# Listing 3-30. Count Number of Observations
pd.value_counts(df['lettergrade'])

##### Sua vez

Recrie o dataframe desta seção e crie uma coluna classificando a linha como aprovada ou reprovada. Isto é para um programa de mestrado que exige uma nota de 80 ou mais para um aluno ser aprovado.

#### Aplicando funções a grupos, compartimentos e colunas

O principal motivo pelo qual uso Python para analisar dados é para lidar com conjuntos de dados maior que um milhão de linhas. A segunda razão é a facilidade de aplicação funções para meus dados. Para ver isso, primeiro precisamos carregar alguns dados (Listagem 3-31).

In [ ]:
# Listing 3-31. Loading a Dataframe from a CSV File
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Em seguida, usamos binning para dividir os dados em notas de letras (Listagem 3.32).

In [ ]:
# Listing 3-32. Using Bins
# Create the bin dividers
bins = [0, 60, 70, 80, 90, 100]
# Create names for the four groups
group_names = ['F', 'D', 'C', 'B', 'A']
df['letterGrades'] = pd.cut(df['grade'],
bins, labels=group_names)
df.head()

Para encontrar a média de horas de estudo por nota, aplicamos nossas funções à coluna agrupada (Listagem 3-33).

In [ ]:
# Listing 3-33. Applying Function to Newly Created Bin
df.groupby('letterGrades')['hours'].mean()

Aplicar uma função a uma coluna é semelhante à Listagem 3.34.

In [ ]:
# Listing 3-34. Applying a Function to a Column
# Applying the integer function to the grade column
df['grade'] = df['grade'] = df['grade']
.apply(lambda x: int(x))
df.head()

- Linha 1: Vamos obter um valor inteiro para cada nota do
quadro de dados. A aplicação de uma função a um grupo pode ser vista na Listagem 3-35.

In [ ]:
# Listing 3-35. Applying a Function to a Group
gender_preScore = df['grade'].groupby(df['gender'])
gender_preScore.mean()

- Linha 1: Crie um objeto de agrupamento. Em outras palavras, criar um objeto que representa esse agrupamento específico. Em neste caso, agrupamos as notas por gênero.
- Linha 2: Exibe o valor médio de cada regimento pontuação pré-teste.

##### Sua vez

Importe o arquivo datasets/gradedata.csv e crie uma nova coluna armazenada do 'status' como aprovado (> 70) ou reprovado (<=70). Então, calcule a média de horas de exercício das alunas com ‘status’ de passagem.

#### Classificação de linhas de dados

É relativamente fácil encontrar a linha com o valor máximo ou o valor mínimo, mas às vezes você deseja encontrar as linhas com 50 os valores mais altos ou os 100 mais baixos para uma coluna específica. Isto é quando você precisa de classificação (Listagem 3-36).

In [ ]:
# Listing 3-36. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Se quisermos encontrar as linhas com as notas mais baixas, precisaremos classificar todas as linhas em ordem crescente por nota. A Listagem 3-37 mostra o código para criar uma nova coluna que é a classificação do valor da nota em ordem crescente.

In [ ]:
# Listing 3-37. Create Column with Ranking by Grade
df['graderanked'] = df['grade'].rank(ascending=1)
df.tail()

Então, se quiséssemos apenas ver os alunos com as 20 notas mais baixas, usaríamos o código da Listagem 3-38.

In [ ]:
# Listing 3-38. Bottom 20 Students
df[df['graderanked'] < 21]

E, para vê-los em ordem, precisamos usar o código da Listagem 3-39.

In [ ]:
# Listing 3-39. Bottom 6 Students in Order
df[df['graderanked'] < 6].sort_values('graderanked')

##### Sua vez

Você consegue encontrar os 50 alunos com mais horas de estudo por semana?

#### Crie uma coluna baseada em uma condicional

Às vezes, você precisa classificar uma linha de dados pelos valores em um ou mais colunas, como identificar os alunos que estão passando ou reprovando se a nota está acima ou abaixo de 70. Nesta seção, aprenderemos como para fazer isso (Listagem 3-40).

In [ ]:
# Listing 3-40. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Agora, digamos que queremos uma coluna indicando se os alunos estão reprovando ou não (Listagem 3-41).

In [ ]:
# Listing 3-41. Create Yes/No isFailing Column
import numpy as np
df['isFailing'] = np.where(df['grade']<70,
'yes', 'no')
df.tail(10)

Linha 1: Importamos a biblioteca numpy
Linha 2: Crie uma nova coluna chamada df.failing
onde o valor é sim se df.grade for menor que 70 e
não, se não.

Se, em vez disso, precisássemos de uma coluna indicando quem eram os alunos do sexo masculino
com pontuações baixas, poderíamos usar o código da Listagem 3.42.

In [ ]:
# Listing 3-42. Create Yes/No isFailingMale Column
df['isFailingMale'] = np.where((df['grade']<70)
& (df['gender'] == 'male'),'yes', 'no')
df.tail(10)

##### Sua vez

Você pode criar uma coluna para timemgmt que mostre ocupado se um aluno exercita mais de três horas por semana E estuda mais de dezessete horas por semana?

#### Criando novas colunas usando funções

Muito do que eu costumava fazer no Excel (e agora uso o Python) é para criar novas colunas com base em uma existente. Então, usando o seguinte data (Listagem 3-43), vamos ver como faríamos isso.

In [ ]:
# Listing 3-43. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Para criar uma única coluna que contenha o nome completo de cada aluno, primeiro criamos uma função para criar uma única string a partir de duas strings (Listagem 3-44).

In [ ]:
# Listing 3-44. Create Function to Generate Full Name
def singlename(fn, ln):
    return fn + " " + ln

Agora, se você testar essa função, verá que ela funciona perfeitamente bem concatenando Adam e Smith em Adam Smith. No entanto, também podemos use-o com seletores de coluna para criar uma nova coluna usando nosso fname e Colunas lname (Listagem 3-45).

In [ ]:
# Listing 3-45. Create Column to Hold the Full Name
df['fullname'] = singlename(df['fname'],df['lname'])

Este código cria uma coluna chamada fullname que concatena o nome e o sobrenome.

##### Sua vez

Você pode criar uma coluna chamada tempo total que some as horas de estudo por semana e as horas de exercício por semana?

#### Convertendo categorias de string em variáveis numéricas

Por que preciso converter categorias de strings em variáveis numéricas? Muitos ferramentas analíticas não funcionarão em texto, mas se você converter esses valores em números, isso torna as coisas muito mais simples (Listagem 3-46).

In [ ]:
# Listing 3-46. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Método 1: converter coluna única para conter variáveis numéricas (Listagem 3-47).

In [ ]:
# Listing 3-47. Function to Convert Gender to Number
def score_to_numeric(x):
    if x=='female':
        return 1
    if x=='male':
        return 0

Agora, execute esse método em sua coluna (Listagem 3.48).

In [ ]:
# Listing 3-48. Apply score_to_numeric Function to Gender
df['gender_val'] = df['gender'].apply(score_to_numeric)
df.tail()

Método 2: Crie colunas booleanas individuais (Listagem 3-49).

In [ ]:
# Listing 3-49. Create Boolean Columns Based on Gender Column
df_gender = pd.get_dummies(df['gender'])
df_gender.tail()

Junte colunas ao conjunto de dados original (Listagem 3-50).

Listagem 3-50. Adicionar novas colunas ao dataframe original

In [ ]:
# Join the dummy variables to the main dataframe
df_new = pd.concat([df, df_gender], axis=1)
df_new.tail()
# or
# Alterative for joining the new columns
df_new = df.join(df_gender)
df_new.tail()

##### Sua vez

Usando datasets/gradesdatawithyear.csv, você pode criar um número coluna para substituir os status de calouro a sênior pelos numerais 1 até 4?

#### Organizando os dados

Ambas as variáveis originais e recém-criadas precisam ser formatadas corretamente
por dois motivos.
Primeiro, para que nossas ferramentas de análise funcionem corretamente com eles. Falha ao formatar
um código de valor ausente ou uma variável fictícia corretamente terá grandes
consequências para sua análise de dados.
Segundo, é muito mais rápido executar a análise e interpretar os resultados se você
não precisa ficar procurando qual é a variável Q156.

Os exemplos incluem o seguinte:
• Removendo colunas desnecessárias
• Alteração de nomes de colunas
• Alterando os nomes das colunas para letras minúsculas
• Formatar variáveis de data como datas e assim por diante.

##### Removendo e Adicionando Colunas

Às vezes precisamos ajustar os dados. Ou alguma coisa foi deixada de fora deveria ter sido incluído ou algo foi deixado que deveria ter sido removido. Então, vamos começar com o conjunto de dados da Listagem 3.51.

In [ ]:
# Listing 3-51. Creating Starting Dataset
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]
GradeList = zip(names,grades,bsdegrees,msdegrees,
phddegrees)
columns=['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = GradeList, columns=columns)
df

Podemos eliminar uma coluna simplesmente adicionando o código da Listagem 3.52.

In [ ]:
# Listing 3-52. Dropping a Column
df.drop('PhD', axis=1)

Com axis=1 informando drop que queremos eliminar uma coluna (1) e não uma linha (0).

Podemos adicionar uma coluna preenchida com zeros definindo o novo nome da coluna para ser igual a 0 (Listagem 3-53).

In [ ]:
# Listing 3-53. Creating a New Column Filled with Zeros
df['HighSchool']=0

Se, no entanto, você quiser definir as novas colunas para valores iguais a nulos, você
pode fazer isso também (Listagem 3-54).

In [ ]:
# Listing 3-54. Creating a New Column Filled with Null Values
df['PreSchool'] = np.nan

Agora, adicionar uma coluna com valores não é tão difícil. Criamos uma série e definimos a coluna igual à série (Listagem 3-55).

In [ ]:
# Listing 3-55. Creating a New Column Filled with Values
d = ([0,1,0,1,0])
s = pd.Series(d, index= df.index)
df['DriversLicense'] = s
df

##### Sua vez

Você pode remover as colunas de bacharelado, mestrado e doutorado?
Você pode adicionar uma coluna de Grau Mágico de Hogwarts? Todos menos Jéssica
tem um; isso torna tudo mais difícil? Não? Então eu tenho que ter certeza de te deixar perplexo
próxima vez.

##### Selecionando Colunas

Você precisará fazer subseleções de seus dados ocasionalmente, especialmente se
seu conjunto de dados tem toneladas de colunas. Aqui, aprendemos como criar um dataframe
isso inclui apenas algumas de nossas colunas (Listagem 3-56).

In [ ]:
# Listing 3-56. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Agora, para selecionar uma coluna de dados, especificamos o nome da coluna
(Listagem 3-57).

In [ ]:
# Listing 3-57. Selecting a Column into a List
df['fname']

Mas se você executar esse código, você obterá apenas os dados da coluna (observe o cabeçalho está faltando). Isso ocorre porque isso não retorna um dataframe; isto retorna uma lista. Para retornar um dataframe ao selecionar uma coluna, precisamos especifique-o (Listagem 3-58).

In [ ]:
# Listing 3-58. Selecting a Column into a Dataframe
df[['fname']]

Para retornar múltiplas colunas, usamos código como o da Listagem 3.59.

In [ ]:
# Listing 3-59. Selecting Multiple Columns into a Dataframe
df[['fname','age','grade']]

E, claro, se quisermos criar um dataframe com esse subconjunto de colunas, podemos copiá-lo para outra variável (Listagem 3-60).

In [ ]:
# Listing 3-60. Creating New Dataframe from Your Selection
df2 = df[['fname','age','grade']]
df2.head()

##### Sua vez

Precisamos criar uma lista de discussão. Você pode criar um novo dataframe selecionando os campos de nome, sobrenome e endereço?

##### ### Alterar nome da coluna

Às vezes você precisa alterar os nomes das suas colunas. Com pandas, é fácil de fazer. Primeiro, você carrega seus dados (Listagem 3.61).

In [ ]:
# Listing 3-61. Load Dataset from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Mas, quando olhamos para o cabeçalho, não ficamos entusiasmados com os nomes das colunas – ou ele não tem nenhum.
É simples alterar os cabeçalhos das colunas (Listagem 3-62).

In [ ]:
# Listing 3-62. Change All Headers
df.columns = ['FirstName', 'LastName', 'Gender',
'Age', 'HoursExercisePerWeek',
'HoursStudyPerWeek', 'LetterGrade',
'StreetAddress']
df.head()

Ou, se quiser apenas alterar um ou dois valores, você pode carregar a lista
de cabeçalhos (Listagem 3-63).

In [ ]:
Listing 3-63. Load List of Headers into a Temp Variable
headers = list(df.columns.values)

Depois que os cabeçalhos forem carregados, você poderá alterar alguns (Listagem 3.64).

In [ ]:
Listing 3-64. Changing Headers
headers[0] = 'FName'
headers[1] = 'LName'
df.columns = headers
df.head()

### Sua vez

Você pode alterar o nome da coluna de idade para anos?

##### Configurando nomes de colunas para letras minúsculas

Pode não ser o maior problema do mundo, mas às vezes preciso
converta todos os nomes das colunas em minúsculas (ou maiúsculas, nesse caso).
Esta lição abordará como fazer isso (Listagem 3-65).

In [ ]:
Listing 3-65. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Depois de ter os dados, existem duas maneiras rápidas de converter todas as colunas
cabeçalhos para letras minúsculas (Listagem 3-66).

In [ ]:
Listing 3-66. Casting All Headers to Lowercase
# method 1
df.columns = map(str.lower, df.columns)
# method 2
df.columns = [x.lower() for x in df.columns]

##### Sua vez

Você consegue descobrir como deixar todos os cabeçalhos das colunas em letras maiúsculas?

##### Encontrando linhas correspondentes

É claro que nem sempre você deseja calcular usando todo o conjunto de dados.
Às vezes você deseja trabalhar apenas com um subconjunto de seus dados. Nesta lição,
descobrimos como fazer isso (Listagem 3-67).

In [ ]:
Listing 3-67. Creating Dataset
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList,
columns=['Names', 'Grades'])
df

Para encontrar todas as linhas que contêm a palavra Mel, use o código mostrado em
Listagem 3-68 em uma nova célula.

In [ ]:
Listing 3-68. Filtering Rows
df['Names'].str.contains('Mel')

Depois de executar essa linha do Python, você verá uma lista de booleanos
valores—True para as linhas que correspondem à nossa consulta e False para aquelas que
não.
Podemos encurtar nossa resposta adicionando .any. Isso exibirá apenas um
single True se alguma linha corresponder e False se nenhuma delas corresponder (Listagem 3-69).

In [ ]:
Listing 3-69. Check if Any Rows Match
# check if any row matches
df['Names'].str.contains('Mel').any()

Alternativamente, você pode adicionar .all. Isso exibirá apenas um único True se todos
das linhas correspondem e False se pelo menos uma delas não corresponder (Listagem 3-70).

In [ ]:
Listing 3-70. Check if All Rows Match
# check if all rows match
df['Names'].str.contains('Mel').all()

Também podemos usar isso junto com a função .loc (locate) para mostrar apenas
as linhas que correspondem a determinados critérios (Listagem 3-71).

In [ ]:
Listing 3-71. Show the Rows that Match
# Find the rows that match a criteria like this
df.loc[df['Names'].str.contains('Mel')==True]
# or even like this...
df.loc[df['Grades']==0]

Sua vez
Você consegue encontrar todas as pessoas que têm pelo menos um mestrado no
seguintes dados (Listagem 3-72)?

In [ ]:
Listing 3-72. Starting Dataset
import pandas as pd
names = ['Bob','Jessi','Mary','John','Mel','Sam',
'Cathy','Hank','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bsdegrees = [1,1,0,0,1,1,1,0,1]
msdegrees = [2,1,0,0,0,1,1,0,0]
phddegrees = [0,1,0,0,0,2,1,0,0]
GradeList = zip(names,grades,bsdegrees,msdegrees,
phddegrees)
df = pd.DataFrame(data = GradeList, columns=['Name','Grade','BS',
'MS','PhD'])
df

### Filtrar linhas com base nas condições

In [ ]:
Listing 3-73. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

Podemos mostrar uma coluna de dados (Listagem 3-74).

In [ ]:
Listing 3-74. One Column
df['grade'].head()

Ou podemos mostrar duas colunas de dados (Listagem 3-75).

In [ ]:
Listing 3-75. Two Columns
df[['age','grade']].head()

Ou podemos mostrar as duas primeiras linhas de dados (Listagem 3.76).

In [ ]:
Listing 3-76. First Two Rows
df[:2]

Para mostrar todas as linhas onde a nota é maior que 80, use o código em
Listagem 3-77.

In [ ]:
Listing 3-77. All Rows with Grade > 80
df[df['grade'] > 80]

Usar múltiplas condições é um pouco mais complicado. Então, se quiséssemos obter uma lista
de todos os alunos com pontuação superior a 99,9 e eram do sexo masculino, teríamos
precisa usar o código mostrado na Listagem 3-78.

In [ ]:
Listing 3-78. All Rows Where Men Scored > 99.9
df.ix[(df['grade'] > 99.9) &
(df['gender'] == 'male') ]

Se, em vez disso, quiséssemos todos os alunos com pontuação superior a 99 OU
fossem mulheres, precisaríamos usar o código da Listagem 3-79.

In [ ]:
Listing 3-79. All Rows Where Women or Scored > 99
df.ix[(df['grade'] > 99) | (df['gender'] == 'female') ]

Sua vez
Você pode mostrar todas as linhas onde o aluno era do sexo masculino, exercitava menos de
duas horas por semana e estudou mais de quinze horas por semana?

#### Seleção de linhas com base nas condições

In [ ]:
Listing 3-80. Load Data from CSV
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

In [ ]:
Listing 3-81. Method 1: Using Variables to Hold Attributes
female = df['gender'] == "female"
a_student = df['grade'] >= 90
df[female & a_student].head()

Linha 1: Criamos uma variável com TRUE se gênero for
fêmea.
Linha 2: Criamos uma variável com TRUE se a nota for
maior ou igual a 90.
Linha 3: É aqui que selecionamos todos os casos em que ambos
o gênero é feminino e a nota é maior ou igual
para 90.

In [ ]:
Listing 3-82. Method 2: Using Variable Attributes Directly
df[df['fname'].notnull() & (df['gender'] == "male")]

Na Listagem 3-82, selecionamos todos os casos onde o primeiro nome não está faltando
e o gênero é masculino.

Sua vez
Você consegue encontrar todas as linhas onde o aluno teve quatro ou mais horas de aula?
exercício por semana, dezessete ou mais horas de estudo, e ainda tinha nota
isso era inferior a 80?

#### Dataframe de amostragem aleatória

Este é simples. Obviamente, às vezes temos conjuntos de dados que são muito
grande e precisamos pegar um subconjunto, então vamos começar com alguns dados carregados
(Listagem 3-83).

In [ ]:
Listing 3-83. Load Dataset from CSV
import pandas as pd
import numpy as np
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.tail()

Para selecionar apenas 100 linhas aleatoriamente desse conjunto de dados, podemos simplesmente executar
o código mostrado na Listagem 3-84.

In [ ]:
# Listing 3-84. Random Sample of 100 Rows from Dataframe
df.take(np.random.permutation(len(df))[:100])

#### Sua vez

Você pode criar uma amostra aleatória de 500 linhas desse conjunto de dados?

In [ ]:
%reload_ext watermark
%watermark -a "Caique Miranda" -gu "caiquemiranda" -iv

### End.